Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/CATG_old/CATG_old.tmx
Source language: en_us
Languages: de_de

source: PATENT CLAIMS
de_de: PATENTANSPRÜCHE

source: 1. Apparatus for generating a virtual image, comprising a housing (1), a mirror (3) and a mirror support (4), wherein
de_de: 1. Vorrichtung zum Erzeugen eines virtuellen Bildes, umfassend ein Gehäuse (1), einen Spiegel (3) und eine Spiegelhalterung (4), wobei

source: the mirror (3) being mounted to the mirror support (4),
de_de: der Spiegel (3) an der Spiegelhalterung (4) montiert ist,

source: the mirror support (4) is configured to supporting the mirror (3) for being mountable inside the housing (1), such that an image received by the mirror (3) is reflected to create the virtual image,
de_de: die Spiegelhalterung (4) konfiguriert ist, um den Spiegel (3) so zu stützen, dass er innerhalb des Gehäuses (1) derart montierbar ist, dass ein von dem Spiegel (3) empfangenes Bild reflektiert wird, um das virtuelle Bild zu erzeugen,

source: the mirror support (4) being configured to support rotation of the mirror (3) inside the housing (1) in a mounted condition of the mirror (3) about an axis (z) of rotation,
de_de: die Spiegelhalterung (4) konfiguriert ist, um eine Drehung des Spiegels (3) innerhalb des Gehäuses (1) in einem montierten Zustand des Spiegels (3) um eine Drehachse (z) zu stützen,

source: the mirror support (4) comprising lateral edges (5, 5’), each of the lateral edges (5, 5’) comprising a point (21, 21’) at which the axis (z) of rotation breaks through the surface of the mirror support (4),
de_de: die Spiegelhalterung (4) Seitenkanten (5, 5') umfasst, wobei jede der Seitenkanten (5, 5') einen Punkt (21, 21') umfasst, an dem die Drehachse (z) die Oberfläche der Spiegelhalterung (4) durchbricht,

source: the mirror support (4) comprises a first and a second protrusion (6, 6’), which in a mounted condition of the mirror (3), each protrude from a respective lateral edge (5,5') in direction of the axis (z) of rotation,
de_de: die Spiegelhalterung (4) einen ersten und einen zweiten Vorsprung (6, 6') umfasst, die in einem montierten Zustand des Spiegels (3) jeweils von einer entsprechenden Seitenkante (5, 5') in Richtung der Drehachse (z) vorstehen,

source: the apparatus comprising a holder (7, 7’), the holder (7, 7’) being fixable to the housing (1) and
de_de: die Vorrichtung einen Halter (7, 7') umfasst, wobei der Halter (7, 7') an dem Gehäuse (1) befestigbar ist und

source: the holder (7, 7’) being configured to lock the opening,
de_de: wobei der Halter (7, 7') konfiguriert ist, um die Öffnung zu verschließen,

source: the holder being configured to restrict a movement of the part (10) in a direction perpendicular to the axis (z) of rotation,
de_de: der Halter konfiguriert ist, um eine Bewegung des Teils (10) in einer Richtung senkrecht zu der Drehachse (z) zu beschränken,

source: the part (10) of the protrusion (6, 6’) being in direct contact to one or more surfaces of the recess (8, 8’) and/or the holder (7, 7’),
de_de: das Teil (10) des Vorsprungs (6, 6') in direktem Kontakt mit einer oder mehreren Oberflächen der Aussparung (8, 8') und/oder des Halters (7, 7') ist,

source: the housing (1) comprising two recesses (8, 8'), a first recess (8) with an opening to receive the part (10) of the first protrusion (6) and a second recess (8’) to receive the part (10) of the second protrusion (6'),
de_de: das Gehäuse (1) zwei Aussparungen (8, 8') umfasst, eine erste Aussparung (8) mit einer Öffnung, um das Teil (10) des ersten Vorsprungs (6) aufzunehmen und eine zweite Aussparung (8'), um das Teil (10) des zweiten Vorsprungs (6') aufzunehmen,

source: wherein,
de_de: wobei

source: the first recess (8), in a mounted condition of the mirror (3), being configured to exclusively allow for a rotation about an axis (z) of rotation of the part (10) inside the first recess (8) and the second recess (8’), in a mounted condition of the mirror (3), being configured to allow for a rotation about an axis (z) of rotation of the part (10) inside the second recess (8’) and for a movement of the part (10) in the second recess (8’) in a direction along the axis (z) of rotation,
de_de: die erste Aussparung (8) in einem montierten Zustand des Spiegels (3) konfiguriert ist, um ausschließlich eine Drehung um eine Drehachse (z) des Teils (10) innerhalb der ersten Aussparung (8) zu erlauben, und die zweite Aussparung (8') in einem montierten Zustand des Spiegels (3) konfiguriert ist, um eine Drehung um eine Drehachse (z) des Teils (10) innerhalb der zweiten Aussparung (8') und eine Bewegung des Teils (10) in der zweiten Aussparung (8') in einer Richtung entlang der Drehachse (z) zu erlauben,

source: characterised in that
de_de: dadurch gekennzeichnet, dass

source: the second recess (8’) comprising means (24, 24’) for delimiting a movement of the part (10) of the second protrusion (6’) in both directions along the axis (z) of rotation when received in the second recess (8’), a surface of the second recess (8’) arranged between the delimiting means forming a contact surface for the part (10) of the second protrusion (6’) when received in the second recess (8’), the extent of the contact surface along the direction of the axis (z) of rotation being larger than the extent of the part (10) of the second protrusion (8’) in the direction of the axis (z) of rotation,
de_de: die zweite Aussparung (8') Mittel (24, 24') zum Begrenzen einer Bewegung des Teils (10) des zweiten Vorsprungs (6') in beiden Richtungen entlang der Drehachse (z), wenn es in der zweiten Aussparung (8') aufgenommen ist, umfasst, eine Oberfläche der zweiten Aussparung (8'), die zwischen den Begrenzungsmitteln angeordnet ist, eine Kontaktfläche für das Teil (10) des zweiten Vorsprungs (6') bildet, wenn es in der zweiten Aussparung (8') aufgenommen ist, wobei die Ausdehnung der Kontaktfläche entlang der Richtung der Drehachse (z) größer ist als die Ausdehnung des Teils (10) des zweiten Vorsprungs (8') in der Richtung der Drehachse (z),

source: wherein the second recess (8') comprises a surface such that the recess (8') comprises a U-formed shape and the second recess (8') further comprises wall portions (24,24'), the wall portions (24,24') delimiting the second recess (8') in both directions along the axis (z) of rotation, between the wall portions (24,24') the bottom of the U-formed shape serves as one contact for the part (10) in the second recess (8'), the extend of this contact surface in direction of the axis (z) of rotation is chosen to be larger than the extend of the part (10) in the direction of the axis (z) of rotation.
de_de: wobei die zweite Aussparung (8') eine Oberfläche derart umfasst, dass die Aussparung (8') einen u-förmigen Verlauf umfasst und die zweite Aussparung (8') ferner Wandabschnitte (24, 24') umfasst, wobei die Wandabschnitte (24, 24') die zweite Aussparung (8') in beiden Richtungen entlang der Drehachse (z) begrenzen, zwischen den Wandabschnitten (24, 24') die Unterseite des u-förmigen Verlaufs als ein Kontakt für das Teil (10) in der zweiten Aussparung (8') dient, wobei die Ausdehnung der Kontaktfläche in Richtung der Drehachse (z) größer gewählt ist als die Ausdehnung des Teils (10) in Richtung der Drehachse (z).

source: 2. Apparatus according to claim 1, the part (10) being received in the recess (8, 8’) in a form-fitting manner in a mounted condition of the mirror (3).
de_de: 2. Vorrichtung nach Anspruch 1, wobei das Teil (10) in dem montierten Zustand des Spiegels (3) formschlüssig in der Aussparung (8, 8') aufgenommen ist.

source: 3. Apparatus according to one of claims 1 or 2, at least one of the part (10), the holder (7, 7’) and a surface of the recess (8, 8’) comprising a lubricant.
de_de: 3. Vorrichtung nach einem der Ansprüche 1 oder 2, wobei das Teil (10), der Halter (7, 7') und/oder eine Oberfläche der Aussparung (8, 8') ein Schmiermittel umfasst.

source: 4. Apparatus according to one of the preceding claims, the apparatus comprising an elastically deformable element, which in a mounted condition of the mirror (3) being elastically prestressed and exerting an elastic force on the part (10).
de_de: 4. Vorrichtung nach einem der vorhergehenden Ansprüche, wobei die Vorrichtung ein elastisch verformbares Element umfasst, das in einem montierten Zustand des Spiegels (3) elastisch vorgespannt ist und eine elastische Kraft auf das Teil (10) ausübt.

source: 5. Apparatus according to claim 4, the holder (7, 7’) being configured as the elastically deformable element.
de_de: 5. Vorrichtung nach Anspruch 4, wobei der Halter (7, 7') als das elastisch verformbare Element konfiguriert ist.

source: 6. Apparatus according to one of the preceding claims, the holder (7, 7’) being made of flat metal.
de_de: 6. Vorrichtung nach einem der vorhergehenden Ansprüche, wobei der Halter (7, 7') aus flachem Metall hergestellt ist.

source: 7. Apparatus according to one of the preceding claims, the holder (7) being fixable to the housing (1) by a rivet and/or by screw (20) connection.
de_de: 7. Vorrichtung nach einem der vorhergehenden Ansprüche, wobei der Halter (7) durch eine Niet- und/oder Schraubverbindung (20) an dem Gehäuse (1) befestigbar ist.

source: 8. Apparatus according to one of the preceding claims, wherein the part (10) is made of plastic material having a low friction coefficient.
de_de: 8. Vorrichtung nach einem der vorhergehenden Ansprüche, wobei das Teil (10) aus Kunststoff mit einem niedrigen Reibungskoeffizienten hergestellt ist.

source: 9. Apparatus according to one of the preceding claims, wherein the recess comprises a coating which consists of PTFE (PTFE: Polytetrafluorethylen).
de_de: 9. Vorrichtung nach einem der vorhergehenden Ansprüche, wobei die Aussparung eine Beschichtung umfasst, die aus PTFE (PTFE: Polytetrafluorethylen) besteht.

source: Apparatus according to one of the preceding claims, wherein the part (10) has a spherical shape.
de_de: Vorrichtung nach einem der vorhergehenden Ansprüche, wobei das Teil (10) einen kugelförmigen Verlauf aufweist.

source: A vehicle comprising an apparatus for generating a virtual image according to one of the preceding claims.
de_de: Fahrzeug, umfassend eine Vorrichtung zum Erzeugen eines virtuellen Bildes nach einem der vorhergehenden Ansprüche.

source: AMENDED CLAIMS
de_de: GEÄNDERTE PATENTANSPRÜCHE

source: 1. A vehicle trailer assist system (24) comprising:
de_de: 1. Fahrzeuganhänger-Assistenzsystem (24), umfassend:

source: a controller (26) configured to display a plurality of target areas (58A-D, 68A-E) on a display (46) to a vehicle operator, record a vehicle operator selected one of the plurality of target areas (58A-D, 68A-E) and determine a relative orientation between a trailer (22) and a tow vehicle (20) based on a relative position between the selected target features on the trailer (22) and the tow vehicle (20), wherein the controller (26) is further configured to recognize the target features from an image (56) captured from a camera (36) disposed on the tow vehicle (20),
de_de: eine Steuerung (26), die konfiguriert ist, um für einen Fahrzeugführer eine Vielzahl von Zielbereichen (58A–D, 68A–E) auf einer Anzeige (46) darzustellen, aufzuzeichnen, dass ein Fahrzeugführer einen der Vielzahl von Zielbereichen (58A–D, 68A–E) ausgewählt hat und eine relative Orientierung zwischen einem Anhänger (22) und einem Zugfahrzeug (20) basierend auf einer relativen Position zwischen den ausgewählten Zielmerkmalen des Anhängers (22) und dem Zugfahrzeug (20) zu bestimmen, wobei die Steuerung (26) ferner konfiguriert ist, um die Zielmerkmale aus einem Bild (56) zu erkennen, das von einer auf dem Zugfahrzeug (20) angeordneten Kamera (36) aufgenommen wurde,

source: characterized in
de_de: dadurch gekennzeichnet,

source: that the controller (26) is further configured to highlight the target areas (58A-D, 68A-E) on the display (46) and provide for selection of one of the highlighted target areas (58A-D, 68-A-E) on the display (46), wherein the controller (26) is configured to identify potential target features from an image of the trailer (22) and to highlight the identified potential target areas for selection by the vehicle operator.
de_de: dass die Steuerung (26) ferner konfiguriert ist, um die Zielbereiche (58A–D, 68A–E) auf der Anzeige (46) hervorzuheben und zur Auswahl von einem der hervorgehobenen Zielbereiche (58A–D, 68-A–E) auf der Anzeige (46) bereitzustellen, wobei die Steuerung (26) konfiguriert ist, um potenzielle Zielmerkmale aus einem Bild des Anhängers (22) zu identifizieren und die identifizierten potenziellen Zielbereiche zur Auswahl durch den Fahrzeugführer hervorzuheben.

source: 2. The vehicle trailer assist system (24) as recited in claim 1, wherein the display (46) is touch sensitive and the controller (26) is configured to record the selected one of the plurality of target areas (58A-D, 68A-E) responsive to the vehicle operator contacting the display (46) at a location corresponding with the highlighted target area (58A-D, 68A-E).
de_de: 2. Fahrzeuganhänger-Assistenzsystem (24) nach Anspruch 1, wobei die Anzeige (46) berührungsempfindlich ist und die Steuerung (26) konfiguriert ist, um den ausgewählten der Vielzahl von Zielbereichen (58A–D, 68A–E) aufzuzeichnen, der auf Berühren der Anzeige (46) durch den Fahrzeugführer an einer Stelle, die dem markierten Zielbereich (58A–D, 68A–E) entspricht, reagiert.

source: 3. The vehicle trailer assist system (24) as recited in claim 1 or 2, wherein the display (46) is mounted within a cabin (50) of the tow vehicle (20) and includes a manually actuated control device configured to cycle between the plurality of target areas (58A-D, 68A-E) shown on the display (46) and to select one of the plurality of target areas (58A-D, 68A-E) shown in the display (46).
de_de: 3. Fahrzeuganhänger-Assistenzsystem (24) nach Anspruch 1 oder 2, wobei die Anzeige (46) in einer Kabine (50) des Zugfahrzeugs (20) angebracht ist und eine manuell betätigte Steuervorrichtung aufweist, die konfiguriert ist, um zwischen der Vielzahl von Zielbereichen (58A–D, 68A–E), die auf der Anzeige (46) gezeigt sind, zyklisch zu wechseln und einen der Vielzahl von Zielbereichen (58A–D, 68A–E), die auf der Anzeige (46) gezeigt sind, auszuwählen.

source: 4. The vehicle trailer assist system (24) as recited in one of claims 1 to 3, wherein the display (46) is actuatable by a vehicle operator to define a target box (64) around features of the image (56) displayed on the display (46) and select the area within the defined target box (64).
de_de: 4. Fahrzeuganhänger-Assistenzsystem (24) nach einem der Ansprüche 1 bis 3, wobei die Anzeige (46) von einem Fahrzeugführer betätigbar ist, um einen Zielrahmen (64) um Mermale des auf der Anzeige (46) dargestellten Bildes (56) herum zu definieren und den Bereich innerhalb des definierten Zielrahmens (64) auszuwählen.

source: 5. The vehicle trailer assist system (24) as recited in one of claims 1 to 4, wherein the highlight of the target features comprises a box (64) disposed on the image (56) visible on the display (46).
de_de: 5. Fahrzeuganhänger-Assistenzsystem (24) nach einem der Ansprüche 1 bis 4, wobei die Hervorhebung der Zielmerkmale einen Rahmen (64) umfasst, der auf dem auf der Anzeige (46) sichtbaren Bild (56) angeordnet ist.

source: 6. The vehicle trailer assist system (24) as recited in one of claims 2 to 5, wherein the target areas are highlighted and the remainder of the image (56) is shown faded out.
de_de: 6. Fahrzeuganhänger-Assistenzsystem (24) nach einem der Ansprüche 2 bis 5, wobei die Zielbereiche hervorgehoben sind und der Rest des Bildes (56) verschwommen gezeigt ist.

source: 7. The vehicle trailer assist system (24) as recited in one of the preceding claims, further comprising a camera (36) and an actuator for steering the tow vehicle (20) to maneuver the trailer (22), the camera configured to obtain an image (56) of the trailer (22) and target features and to communicate the image (56) of the trailer (22) to the display (46).
de_de: 7. Fahrzeuganhänger-Assistenzsystem (24) nach einem der vorhergehenden Ansprüche, ferner umfassend eine Kamera (36) und ein Stellglied zum Lenken des Zugfahrzeugs (20), um den Anhänger (22) zu rangieren, wobei die Kamera konfiguriert ist, um ein Bild (56) des Anhängers (22) und von Zielmerkmalen zu erlangen und das Bild (56) des Anhängers (22) an die Anzeige (46) zu übermitteln.

source: 8. A method of operating a vehicle trailer assist system (24) comprising:
de_de: 8. Verfahren zum Betreiben eines Fahrzeuganhänger-Assistenzsystems (24), umfassend:

source: displaying a plurality of target areas (58A-D, 68A-E) to a vehicle operator via a display (46);
de_de: Darstellen einer Vielzahl von Zielbereichen (58A–D, 68A–E) für einen Fahrzeugführer über eine Anzeige (46);

source: recording a vehicle operator selected one of the displayed plurality of target areas (58A-D, 68A-E); and
de_de: Aufzeichnen, dass ein Fahrzeugführer einen der Vielzahl von Zielbereichen (58A–D, 68A–E) ausgewählt hat; und

source: determining a relative orientation between a trailer (22) and a tow vehicle (20) based on a relative position between the selected target features (58A-D, 68A-E) on the trailer (22) and the tow vehicle (20);
de_de: Bestimmen einer relativen Orientierung zwischen einem Anhänger (22) und einem Zugfahrzeug (20) basierend auf einer relativen Position zwischen den ausgewählten Zielmerkmalen (58A–D, 68A–E) des Anhängers (22) und des Zugfahrzeugs (20);

source: recognizing the target features from an image (56) captured from a camera (36) disposed on the tow vehicle (20);
de_de: Erkennen der Zielmerkmale aus einem Bild (56), das von einer auf dem Zugfahrzeug (20) angeordneten Kamera (36) aufgenommen wurde;

source: characterized by highlighting the target areas (58A-D, 68A-E) on the display (46) and providing for selection of one of the highlighted target areas (58A-D, 68A-E) on the display (46), wherein potential target features are identified from an image of the trailer (22) and wherein the identified potential target areas are highlighted for selection by the vehicle operator.
de_de: gekennzeichnet durch Hervorheben der Zielbereiche (58A–D, 68A–E) auf der Anzeige (46) und Bereitstellen von einem der hervorgehobenen Zielbereiche (58A–D, 68-A–E) auf der Anzeige (46) zur Auswahl, wobei potenzielle Zielmerkmale aus einem Bild des Anhängers (22) identifiziert und die identifizierten potenziellen Zielbereiche zur Auswahl durch den Fahrzeugführer hervorgehoben werden.

source: CLAIMS
de_de: ANSPRÜCHE

source: 1. An assembly (24) comprising:
de_de: 1. Anordnung (24), umfassend:

source: a clip portion (32) including a first flexible flange (42) and a second flexible flange (44) that each at least partially define a central retainer passage (46);
de_de: einen Clipabschnitt (32) mit einem ersten flexiblen Flansch (42) und einem zweiten flexiblen Flansch (44), die jeweils mindestens teilweise einen zentralen Haltedurchgang (46) definieren;

source: a flexible hinge (28) connecting the clip portion (32) to a structure (20);
de_de: ein flexibles Scharnier (28), das den Clipabschnitt (32) mit einer Struktur (20) verbindet;

source: a lock portion (34) located adjacent a second end of the central retainer passage (46) opposite the flexible hinge (28) located adjacent a first end of the central retainer passage (46) and
de_de: einen Verriegelungsabschnitt (34), der benachbart zu einem zweiten Ende des zentralen Haltedurchgangs (46) gegenüber dem flexiblen Scharnier (28) angeordnet ist, das benachbart zu einem ersten Ende des zentralen Haltedurchgangs (46) angeordnet ist, und

source: a tab (56; 156) located adjacent an opposite end of the clip portion (32) from the flexible hinge (28),
de_de: eine Lasche (56; 156), die benachbart zu einem dem flexiblen Scharnier (28) gegenüberliegenden Ende des Clipabschnitts (32) angeordnet ist,

source: wherein, the clip portion (32), the flexible hinge (28), and the structure (20) are a single piece unitary component,
de_de: wobei der Clipabschnitt (32), das flexible Scharnier (28) und die Struktur (20) ein einstückiges einheitliches Bauteil sind,

source: wherein the structure (20) includes a flange (26) having a stud opening (38),
de_de: wobei die Struktur (20) einen Flansch (26) mit einer Bolzenöffnung (38) aufweist,

source: the assembly (24) including a mounting stud (30) extending through the stud opening (38) and located in the central retainer passage (46) and in engagement with the first flexible flange (42) and the second flexible flange (44),
de_de: die Anordnung (24) einen Befestigungsbolzen (30) aufweist, der sich durch die Bolzenöffnung (38) erstreckt und in dem zentralen Haltedurchgang (46) angeordnet ist und in Eingriff mit dem ersten flexiblen Flansch (42) und dem zweiten flexiblen Flansch (44) ist,

source: wherein the first flexible flange (42) and the second flexible flange (44) surround in an engaged position the mounting stud (30) wherein a stud opening (50) defined between the first and second flexible flanges (42, 44) extend parallel to a longitudinal axis of the mounting stud (30).
de_de: wobei der erste flexible Flansch (42) und der zweite flexible Flansch (44) in einer Eingriffsposition den Befestigungsbolzen (30) umgeben, wobei eine Bolzenöffnung (50), die zwischen dem ersten und dem zweiten flexiblen Flansch (42, 44) definiert ist, sich parallel zu einer Längsachse des Befestigungsbolzens (30) erstreckt.

source: 2. The assembly (24) of claim 1, wherein the central retainer passage (46) includes a contoured surface.
de_de: 2. Anordnung (24) nach Anspruch 1, wobei der zentrale Haltedurchgang (46) eine konturierte Oberfläche aufweist.

source: 3. The assembly (24) of claim 2, wherein the contoured surface defines a threaded surface.
de_de: 3. Anordnung (24) nach Anspruch 2, wobei die konturierte Oberfläche eine Gewindeoberfläche definiert.

source: 4. The assembly (24) of claim 1, wherein a first distal end of the first flexible flange (42) and a second distal end of the second flexible flange (44) each flair outward and away from the central retainer passage (46).
de_de: 4. Anordnung (24) nach Anspruch 1, wobei ein erstes distales Ende des ersten flexiblen Flansches (42) und ein zweites distales Ende des zweiten flexiblen Flansches (44) sich jeweils nach außen und weg von dem zentralen Haltedurchgang (46) ausweiten.

source: 5. The assembly (24) of claim 1, wherein the lock portion (34) includes a ring (52) having a central opening.
de_de: 5. Anordnung (24) nach Anspruch 1, wobei der Verriegelungsabschnitt (34) einen Ring (52) mit einer zentralen Öffnung aufweist.

source: 6. The assembly (24) of claim 5, wherein the central opening of the ring (52) is at least partially aligned with the central retainer passage (46).
de_de: 6. Anordnung (24) nach Anspruch 5, wobei die zentrale Öffnung des Rings (52) mindestens teilweise mit dem zentralen Haltedurchgang (46) ausgerichtet ist.

source: 7. The assembly (24) of claim 5, wherein the ring (52) includes a radially inner mounting stud contact surface.
de_de: 7. Anordnung (24) nach Anspruch 5, wobei der Ring (52) radial eine innere Befestigungsbolzenkontaktfläche aufweist.

source: 8. The assembly (24) of claim 5, including a neck portion (54) surrounding less than 50% of the central retainer passage (46) and connecting the clip portion (32) to the lock portion (34).
de_de: 8. Anordnung (24) nach Anspruch 5, die einen Halsabschnitt (54) aufweist, der weniger als 50 % des zentralen Haltedurchgangs (46) umgibt und den Clipabschnitt (32) mit dem Verriegelungsabschnitt (34) verbindet.
